{
    "real_text": [
      {
        "title": "Nuclear Weapons Ban Treaty Signed by 50 Nations",
        "content": "On Wednesday, representatives from fifty nations gathered to sign a landmark treaty that officially bans the use, development, stockpiling, and deployment of nuclear weapons under any circumstances. This legally binding agreement, which has been in discussion for years, is seen as a significant step toward global nuclear disarmament. However, the treaty has faced strong opposition from nuclear-armed nations, which argue that such a ban is impractical without a structured process for phased disarmament. Despite these objections, supporters believe that the treaty sends a powerful message about the international community’s stance against nuclear weapons and their catastrophic consequences. The treaty will come into effect 90 days after at least 50 countries complete their ratification processes. While enforcement mechanisms remain a challenge, advocates view this agreement as a moral and legal foundation for future disarmament efforts, hoping it will pave the way for a world free from the threat of nuclear warfare."
      },
      {
        "title": "New Dengue Virus Variant Discovered in India",
        "content": "A team of scientists from the Pune-based National Institute of Virology in India has made a crucial discovery regarding the dengue virus. They recently identified a new genetic variant of the existing DENV-1 strain in Tamil Nadu, raising concerns about its potential impact on public health. This strain was found to be responsible for multiple outbreaks in Tamil Nadu in 2012 and in the neighboring state of Kerala in 2013. Researchers suggest that this specific strain likely originated from Singapore, where it was linked to severe dengue epidemics in 2005. Dengue, a mosquito-borne viral infection, presents flu-like symptoms but can develop into severe conditions such as dengue hemorrhagic fever or dengue shock syndrome, both of which can be fatal. Given the increasing frequency of dengue outbreaks in India, health officials are now monitoring the spread of this new variant closely, emphasizing the need for improved vector control measures, early detection systems, and vaccine research to combat the evolving threats posed by the virus."
      },
      {
        "title": "Virat Kohli Sets New Record in ODI Cricket",
        "content": "Indian cricket captain Virat Kohli has once again proven his dominance in international cricket by becoming the first-ever batsman to score over 500 runs in a bilateral One Day International (ODI) series. He achieved this historic feat during the sixth ODI against South Africa on Friday, solidifying his reputation as one of the greatest batsmen of all time. Previously, the record for the highest run tally in a single bilateral ODI series was held by Indian cricketer Rohit Sharma, who had amassed 491 runs against Australia in 2013. Kohli’s remarkable consistency and ability to perform under pressure have made him a standout figure in modern cricket. In addition to this achievement, he also became the fastest player in history to reach 17,000 international runs across all formats—Test, ODI, and T20—breaking yet another long-standing record. Cricket analysts and fans alike continue to marvel at Kohli’s skill, dedication, and relentless pursuit of excellence, as he continues to set new benchmarks in the sport."
      },
      {
        "title": "Bollywood Celebrities Celebrate Karva Chauth",
        "content": "Bollywood actresses Shilpa Shetty, Sridevi, and Raveena Tandon recently shared glimpses of their grand Karva Chauth celebrations on social media, delighting their fans with pictures and videos from the festive occasion. The celebration took place at the residence of Sunita Kapoor, the wife of veteran actor Anil Kapoor, where the actresses gathered with family and friends for the traditional observance of the Hindu festival. Karva Chauth is an auspicious occasion in India, where married women observe a day-long fast, refraining from food and water from sunrise until moonrise, as a prayer for the longevity and well-being of their husbands. The festival is marked by vibrant traditions, including elaborate mehndi (henna) application, dressing in beautiful ethnic attire, and performing special prayers. Shilpa Shetty, known for her playful social media presence, humorously captioned one of her videos, 'Good behavior is easy when you are fasting (or starving)!' The festival holds deep cultural significance, and its grand celebration by Bollywood celebrities has made it an annual highlight on social media, drawing attention from fans and followers worldwide."
      },
      {
        "title": "Zara Faces Backlash Over £70 Skirt Resembling Traditional Lungi",
        "content": "Spanish fashion giant Zara has sparked an online debate after introducing a new skirt priced at £70 (approximately ₹6,000), which many social media users claim resembles the traditional South Asian lungi. The lungi, a simple checkered cloth often worn by men in India, Sri Lanka, and Bangladesh, is commonly available for as little as ₹300 (around £3), making the price tag on Zara’s version seem excessive to many. Twitter users quickly took notice, with one commenting, 'You can’t be serious. Zara is trying to sell my dad’s £3 lungi for £70!' Another user added, 'My dad’s lungi is probably cheaper than three pounds!' The discussion gained momentum as people debated the recurring pattern of global fashion brands rebranding traditional garments as high-end fashion pieces while failing to acknowledge their cultural origins. While some found humor in the situation, others criticized Zara for cultural appropriation and the ongoing commercialization of traditional attire without due recognition. This incident is yet another example of how luxury fashion brands often draw inspiration from indigenous clothing while repackaging it for the global market, sparking debates on ethical fashion and cultural representation."
      }
    ]
  }
  